return 
[=[
--------------------------在这里开始写日志----------------------------
2026.5.10 9.7
感谢金主 钱 的定制！
【地图图标】增加分支功能【洞穴楼梯标记】
现在游历洞穴或者楼梯，将会和【虫洞图标】一样染色+数字标记


2026.5.6 9.62
非常感谢好饥友 THEDOG 提供的代码：
【视角变换】修复一些可能的崩溃
【中键查找】修复查找箱子会查找附近非容器单位的问题
【智能锅】限制4个格子的锅才会启用提示
【记忆力】现在启用insight时，绘卷的高亮会自动禁用了

2026.5.5 9.61
【中键查找】修复无法查找鹿角的问题


2026.5.3 9.6
【远控面板】增加【解锁科技】的功能


2026.4.28 9.57
【自动工作】
增加了【锤击】的动作，但是只支持作物和发条堆，还有垃圾栅栏
修复禁用某些动作仍然能生效的问题
【视野变换】
修复更换角色时，如果默认是大视野，会让角色视野变的异常大的问题


2026.4.24 9.54
【排队论】提升了排队论交互晾肉架的速度
【地图图标】修复模组图标丢失后崩溃的问题
【小功能绑定】增加小网格模式
【局内文本框】修复无字符时完全透明的bug




2026.4.24 9.51
感谢金主 い 的定制！
【排队论】支持所有容量的晾肉架
【远控面板】修复生成晾肉巨架是损坏的问题
【远控面板】修复活动红包不能通过搜索中文显示的问题


2026.4.24 9.5
感谢金主 一只彩虹糖的梦 的定制！
【风滚草标记】现在支持显示风滚草刷新点了
【WeGame】不再提供支持了，建议wegame玩家换到steam平台


2026.4.22 9.4
【滤镜渲染】
增加wx78备份底盘滤镜
增加wx78无人机滤镜
【视角变换】
修复切换视野后放缩的问题


2026.4.18 9.24
【记忆力】增加对夜光模式的修改
【绘卷·风华】修复获取备份机器人信息时崩溃的问题


2026.4.17 9.23
【队列双击】修复失灵的问题
【季节时钟】修复wx78血量数值位置偏移的问题
【排队论加强】修复部分场景下，装备雨伞也会被切手杖的问题


2026.4.16 9.2
感谢金主 世世 的定制！
【驯牛辅助】支持自选 喂食牛牛/下鞍步行/关闭 了
【降雨预测】修复因为读取季节失败崩溃的问题（可能修了，没有测试）


2026.4.13 9.12
【自动工作】修复采集过熟石果的问题


2026.4.12 9.11
【功能面板】适配某些定制字体
【节日彩蛋】修复非节日仍然加载的浪费性能的问题
【制作栏】修复部分mod导致制作栏图标错位的问题



2026.4.10 9.1
感谢金主 米米 的定制！
【自动工作】现在可以按键进行一些自动化的操作了
【远控面板】食人花种子分配到【物品/种植】分类下


2026.4.5 9.07
【远控面板】修复【传送下一个】偶尔原地传送的问题



2026.3.20 9.06
【排队论加强】
非常感谢好饥友 THEDOG 提供的代码：
适配水壶装水浇水
适配塞堆肥桶

2026.3.19 9.052
【自动烹饪】尝试修复重复开关锅的问题
【季节时钟】非常感谢好饥友 THEDOG 提供的代码：
1、修复了不显示具体雨露值的问题
2、适配了showme显示淘气值
3、增加了对饮水数值的兼容


2026.3.5 9.04
【范围追踪】增加薇机人的范围
【功能面板】调整界面交互细节，修复潜在异常问题
【滤镜】优化渲染适配逻辑，改善部分场景显示效果
【本地指令】调整执行规则，增强兼容性与响应表现
【视角变换】调整切换流畅度，优化操作手感
【装备脱落】修复相关异常表现，完善场景适配规则
【自动划船】调整触发条件，优化连续运行效果
【切换延迟补偿】优化参数适配，提升网络环境兼容

2026.3.5 9.0
【自动烹饪】移除了查找食材和按住ctrl仅收获的功能，修复卡锅问题


2026.3.1 8.99
【精准施法】
允许玩家自定义法杖了
增加了额外的绑定按键，允许局内快捷键开关了
【远控面板】
三种惊喜种子划分到【物品/种植】分类下



2026.2.26 8.97
感谢金主 宇 的定制，新年快乐！
【自动抓蝴蝶】现在自动捉蝴蝶可以自定义捕捉生物了，也能绑定额外按键

2026.2.22 8.96
感谢金主 世世 的定制，新年快乐！
【范围追踪】增加瓦器人工作范围
【远控面板】
修复开大量mod时的卡顿问题
修复【施肥】无法给周围耕地拉满肥料和水分的问题




2026.2.21 8.954
解决了一些提出问题的群友


2026.2.20 8.953
解决了一些已知问题


2026.2.18 8.94
【boss倒计时】
增加镀金骑士
【快捷宣告】
增加模糊宣告的功能
【远控面板】
修复无法删除陨石痕迹等的问题
增加镀金骑士

2026.2.9 8.92
感谢金主 隔壁の老怂 的定制，新年快乐！
【远控面板】增加获取蓝图的功能
【配方拿取】修复一个意外崩溃

2026.1.29 8.902
修复【图标库】若干mod皮肤无法正常显示的问题
修复【物品信息】遇到部分mod崩溃的问题


2026.1.27 8.9
【自动浇灌】感谢金主 "小宇" 的定制
现在支持功能面板浇灌附近耕地以及填充水壶了

2026.1.26 8.8
【自动宰杀】感谢金主 "小宇" 定制
现在支持功能面板宰杀身上的生物了，可以自选宰杀品类或者位置


2026.1.18 8.772
【沃尔特辅助】感谢金主"武麒麟"定制
现在支持显示蓄力范围了
【浅海显示】
修复双击码头地皮也持续显示放置区域的问题
【远控面板】
范围击杀不再打墙或建筑


2026.1.17 8.76
【二群开放】一群满了，开放二群辣：2155066095
【箱子物品高亮】修复暗影容器无法正常高亮的问题
【浅海显示】拿起码头地皮时，会显示可放置的区域了
【女工辅助】修复非女工建筑也显示【收回+拾起】的问题


2026.1.16 8.73
【女工辅助】感谢金主xio的定制
现在鼠标放到投石机发电机等上面时，会显示可放置的区域了
【智能锅】
修复和【山海迷藏】的冲突问题
【勋章辅助】
修复 收取烹饪锅的食物时 切换植物勋章的问题（原因是两个代码都是harvest）
增加 【巧手时机】，可设置按住shift时再切巧手勋章


2026.1.15 8.71
【女工辅助】
1、右键点击物品栏的投石机发电机等，原地放置
2、右键收回地上的投石机发电机等，会在收回后自动捡起
3、快捷键原地放置
4、快捷键收回并捡起附近投石机发电机等
5、快捷键原地部署1个发电机+6个投石机
6、快捷键收起附近所有的发电机+投石机
【行为排队论】
不再存储自动采集的记忆，玩家上下洞穴总要手动开启
【拼音搜索】
绘卷自带的拼音搜索只支持简体汉字，这样会优化很多


2026.1.7 8.605
【棱镜辅助】
可通过按键触发子圭瀚了

2026.1.7 8.604
【勋章辅助】内容扩展
适配仿制勋章
需要注意的是，如果放在融合勋章里，然后关闭了融合勋章，就识别不了了
设置允许玩家决定在海上是否切换勋章了（防止踏水）


2026.1.6 8.602
【勋章辅助】内容扩展
食人花手杖：采摘的时候
丰收勋章：采摘的时候
摇铃铛自动切换淘气勋章
打坎普斯等会装备逮捕勋章
打怪物会装备正义勋章
拿种子带虫木/植物勋章

2026.1.5 8.6
【绘卷·春】
注意：现在【切换延迟补偿】的按键需要玩家手动在面板启用了
【小功能绑定】【一键切换延迟补偿】【快速退出】等绑快捷键的小功能统一归纳了
【退出到主页】一键返回到游戏主页
【退出到桌面】一键返回到游戏主页，然后自动退出游戏

【勋章辅助】
现在在放置建筑时也能装配巧手勋章了
【风华篇】
【自动攻击】修复通过关掉【按键启动】后，重进游戏快捷键依然生效


2026.1.4 8.503
【定制功能】勋章辅助
攻击目标时自动装备或脱落女武神的勋章
砍树自动装备三种伐木勋章（支持排队论）
挖矿自动装备三种矿工勋章（支持排队论）
陆地钓鱼自动装备三种钓鱼勋章
海钓自动装备两种钓鱼勋章
点击锅和料理站自动装备三种厨师勋章
制作物品时自动装备两种巧手勋章


2026.1.2 8.502
【排队论加强】适配【能力勋章】
【切个手杖】适配【棱镜】

2026.1.1 8.5
元旦快乐呀！
【装备脱落】修复不开启此功能时，切个手杖会失灵的问题
【数据调试打印】新增功能，随时随地查看数据表
【开发者相关】开发者模式提高门槛



2025.12.25 8.413
【滤镜渲染】继续重写滤镜，屏幕亮度调整
【怪物预警】修复蚁狮预警失效的问题


2025.12.25 8.4
感谢金主 69年专业刮痧 的定制！
【按键丢弃】丢弃暗影伞后，会自动打开
【我的笔记】移除关于海带加好感的部分
【远控面板】可以移除世界上的卵石路等等了
【驯化修复】被拆分为【驯牛辅助】和【按键修复】
【远控面板】铜手指分门别类允许一些过时接口的模组地皮了
【远控面板】增加【催眠】功能，范围催眠周围实体或玩家60秒
【远控面板】修复无法传送战车雕像的问题（为什么主教和骑士都是头，战车是鼻子）


2025.12.23 8.33
感谢金主 悠悠 的定制
【远控面板】铜手指支持分门别类模组地皮了
【远控面板】修复没有封面的模组不能正常显示名字的问题
【怪物预警】兼容永不妥协的蝎子，不会误报了


2025.12.22 8.32
【滤镜渲染】增加大量可控制的滤镜特效


2025.12.21 8.311
【滤镜渲染】继续重写部分滤镜

2025.12.20 8.31
感谢金主 打怪兽 的定制
【滤镜渲染】部分滤镜重写
【行为排队论】支持挨个分解堆叠的物品了
【范围追踪】增加了【能力勋章】各个生物的攻击范围


2025.12.19 8.3
感谢金主 龙舞清风v 的定制
现在【自动池钓】可以自动更换池塘，以及自动捡鱼了
【皮肤预设套装】修复部分角色崩溃的问题


2025.12.19 8.231
【风华篇·自动攻击】
【忽略友好】会检测领主的领主了
【不打墙体】不打建筑改为不打墙体，这样就能打蜗牛巢了


2025.12.18 8.21
【风华篇·自动攻击】
【忽略友好】会检测附庸的附庸了
【增设按键】增加了一套按键，玩家能用快捷键触发然后面板修改设置了
【自定义忽略】允许玩家自己订阅不索敌的生物名单了
【绘卷·春】
【切个手杖】现在支持骑行时使用远程武器了



2025.12.16 8.202
感谢金主 景典 的定制
【沃尔特辅助】
增加【瞄准方案】的设置，设置【辅助瞄准】时的瞄准策略
增加【瞄准角度】的设置，设置【瞄准方案】涉及方向时自动过滤
【静电任务+】
修复有时鬼畜的情况



2025.12.15 8.201
感谢金主 饭港鬼影诺梦 的定制
【静电任务+】天体后裔版本的自动化做风暴任务
【远控面板】【单人】分类下右键【芜猴】也能取消诅咒了
【方向指示】增加【未约束的静电】
【切个手杖】装备静电约束仪时不再切手杖
【开发接口】增加ForceEquipWalk/ForceWalkTo函数，用于强制切换手杖
【沃尔特辅助】
增加【接连蓄力】的功能，在【辅助松手后】按住右键瞄准会继续尝试蓄力



2025.12.14 8.102
感谢金主 忆往昔 的定制，继续更新定制的四个功能
【翎羽猎手】
现在此功能可额外绑定快捷键了
联动【切个手杖】支持自动切手杖了
【沃尔特辅助】
增加【辅助瞄准】的功能，会自动聚焦鼠标附近的生物
增加【辅助蓄力】的功能，可设置蓄力后自动松手的帧数
【绘卷·春】
【模组配置】修复自动吃饭显示自动海钓的问题
【记忆力】修复打包纸记忆可能崩溃的问题


2025.12.13 8.04
感谢金主 忆往昔 的定制，接下来将依次增加四个功能
【绘卷·冬】
【翎羽猎手】定制的第二个功能，沃尔特辅助下属功能，用来挂机打鸟
【快捷冲刺】定制的第三个功能，鼠标中键直接使用【冲刺小狗】
【翎羽猎手】二改，现在打死一个生物才会切换下个生物了


2025.12.12 7.911
感谢金主 忆往昔 的定制，接下来将依次增加四个功能
【绘卷·春】
【自动吃饭】定制的第一个功能，允许玩家自己设定血量和饥饿吃掉指定的食物
【物品高亮】现在沃比能正常高亮了
【自动吃饭】二改：现在允许饥饿和低生命时吃两种不同的食物了


2025.12.10 7.843
【绘卷·秋】
【几何布局】不再和官方几何同时运行，具体原因可加群咨询
【绘卷·春】
【滤镜渲染】对水中木的部分完成重写，现在默认启用【巨树华盖】了




2025.12.9 7.842
【绘卷·春】
【按键丢弃】修复依次丢弃按照物品栏排序而不是按照
【绘卷·冬】
【温蒂辅助】感谢金主闲来食茶。的定制，增加【鬼上身！】快捷键
【绘卷·风华】
给走A切A增加了排除建筑的模式
【特别鸣谢】为玩家颁发特效，感谢为绘卷制作了视频教程



2025.12.7 7.838
【女工辅助】修复薇诺娜快捷键不能即时触发的问题
【远控面板】为所有出生点增加了额外的标记符号
【特别鸣谢】为两位玩家颁发特效，感谢他们为绘卷制作了视频教程


2025.12.6 7.833
【远控面板】
修复部分玩家芜猴转换时崩溃的问题
玩家死亡时刷物品将生成在脚下，而不是物品栏
【快捷宣告】wx78语句更改
【特别鸣谢】为玩家颁发特效，感谢为绘卷制作了视频教程
【教程链接】视频教程的链接嵌入模组



2025.12.5 7.83
【特别鸣谢】为两位玩家颁发特效，感谢他们为绘卷制作了视频教程


2025.12.4 7.82
【绘卷·春】
【游戏滤镜】开始重写，会时不时更新一两个滤镜到新滤镜里，直到全部写完
【按键丢弃】感谢金主 隔壁の老怂 的定制，现在支持自定义丢弃任意数量的任意物品了
【绘卷·冬】
【小恶魔辅助】增加【打开罐子】的快捷键绑定功能
【绘卷·夏】
【远控面板】不再和其他控制台冲突


2025.12.2 7.8
【功能提示】为大量功能撰写了开发计划或定制计划
【特别鸣谢】为两位玩家颁发特效，感谢他们为绘卷制作了视频教程



2025.11.25 7.705
【行为排队论】修复满燃料时无法交互雪球机的问题
【地图图标】修复麋鹿鹅/鸭 巢穴图标丑陋的问题
【小丑机辅助】已经上线创意工坊，比较超模，所以不在绘卷基础篇章，请单独订阅
功能面板图标问题修复
【特别鸣谢】为两位玩家颁发特效，感谢他们为绘卷制作了视频教程
【超级宣告】尝试修复部分玩家不能正常导入语料的问题



2025.11.24 7.601
【绘卷·春】
【火中取蜜】
感谢金主 宇 的定制！
增加了老慕斯的功能火中取蜜：点燃蜂箱并收取蜂蜜
注意：请自备雪球机和龙鳞甲。
【功能面板】更换若干功能按钮图标
【模组功能】增加了若干功能的冲突检测


2025.11.19 7.552
【绘卷·春】
【地块儿】功能支持点击铺设了，而不是仅仅拖拽铺设
【绘卷·秋】
行为排队论增加【躲避巨石树】的功能，感谢金主Ningishu的定制！



2025.11.18 7.542
【远控面板】
增加【地块儿】功能，方便铺设地皮
现在【全屏清理】需要确认
【物品-种植】分类增加巨石树种子和桦树果
【拼音搜索】修复输入内容为正则字符串时会崩溃的问题
【功能面板】部分文本歧义修复
【按键修复】移除了多余的设置
【特别鸣谢】
󰀍为多位为绘卷制作视频教程的玩家颁发特效！
󰀍非常感谢󰀍！



2025.11.15 7.53
【拆解重复皮肤】修复连点器相关问题
【远控面板】
增加一个关闭面板的按钮
修复【龙蝇之年】【蠕虫之年】未能正确显示的问题

2025.11.14 7.52
修复【彩蛋模式】非开发者崩溃的问题
【远控面板】
增加【底部小旗】模式，用来快速处理保存或重载
修复在角色复活期间不能开关面板的问题
【绘卷·阿羊篇】
【UI美化】移除了【特别鸣谢】【模组答疑】按钮
【去除噪音】允许玩家自定义禁止实体的声音了


2025.11.13 7.516
【绘卷·春】
【彩蛋模式】增加统计实体信息的功能
【远控面板】修复【清空物品栏】时，实体仍然在(0, 0, 0)的问题


2025.11.12 7.512
【绘卷·春】
【重复皮肤拆解】限定使用该功能时不能开启其他mod
【功能面板】增加一个信息打印功能作为彩蛋
【物品整理】尝试修复整理失败的情况
【拼音搜索】支持大小写匹配
【绘卷·秋】
【行为排队论】修复不能继续鼠标上的物品的动作的问题


2025.11.11 7.502
【绘卷·春】
上新全新的【日志系统】！现在玩家可以一键打开查看日志了！
【绘卷·夏】
修复【超级宣告】绑定快捷键后，打开不开设置面板的问题
.
另外祝大家双11快乐，不要像我一样在这里更新模组
Orz...


2025.11.11 7.46
【绘卷·春】
感谢两位金主 枯榾、平安 的定制：
新增功能【拼音搜索】：现在制作栏支持拼音首字母和全拼搜索了
同时【远控面板】【物品选择器】等等支持搜索的页面均支持拼音搜索了
之后该功能也会出单独的mod，订阅绘卷的玩家也不用额外订阅
夏【远控面板】
模组皮肤和特效等不再显示


2025.11.10 v7.45
春
【物品整理】尝试修复整理失败的情况
【配方拿取】使用了科雷最新的接口，现在速度杠杠的
【按键修复】修复未能正确读取设置的名单的问题
冬【恶魔人辅助】
修复不开洞穴时，超限丢弃等功能失灵的问题
修复大量灵魂到来时，只丢弃一个的问题
夏【远控面板】
增加【移除所有】物品的功能

2025.11.8 v7.42
完善了接口 d_util:OpenContainer()
如下功能受到影响：
行为排队论：晾肉架收获
右键加强：配方拿取




2025.11.7 v7.401
QQ群已开放！
有疑问或bug可添加Q群2155066095反馈。


2025.11.6 v7.4
本次更新主要面向开发者
【远控面板】
【开发者选项】：进档自动开启上帝模式和创造模式，方便测试
【扩展权限】：该选项仅对开发者模式的玩家有效
【超级宣告】
【启用调试】功能被强制启用，玩家无需再手动开启该功能
【功能联动】宣告物品栏的配方也会临时将该配方添加到【远控面板】的【收藏】第一位了

2025.11.2 v7.3
【绘卷·春】
感谢金主 逆风 的定制：
【物品管理器】的【按键修复】功能被独立出来，变为了【驯化修复】
【物品选择器】的联动功能增加明显提示
【驯化修复】
此功能包含如下功能并按顺序执行：
1、按键快速修复物品
2、按键骑行最近的牛(没有可修复的物品)
3、按键牛铃铛绑定(没有可骑行的牛，但是身上有铃铛)
4、按键喂食骑着的牛牛(已经骑着牛牛，而且没有可修复的物品)


【绘卷·冬】
运行库迁移至【绘卷·春】
ForModder：
showscreen 增加了title_help参数，用于显示帮助文本的标题


2025.11.2 v7.2
【绘卷·春】
修复自动分解重复皮肤失败的问题

【绘卷·夏】
【远控面板】尝试修复部分玩家搜索文本时崩溃的问题
【远控面板】修复在【全部】标签下，只能收藏一个的问题


2025.11.1 v7.121
【夏·超级宣告】
感谢金主 咬一口星星奶酪 的定制
·
修复了有时宣告物品超出上限不准确的情况
【春】
For Modder:
e_util:GetStackSize修复不开洞穴时数量错误的问题

2025.10.29 v7.12
【绘卷 · 可可篇】
自动做某模组任务
模组控制快捷键
强制启用功能设置


2025.10.29 v7.11
【远控面板】
将功能改为按下按键后立即触发，而不是抬起按键时触发
进游戏后台自动加载（之前是首次按下时加载，玩家不懂我苦心节省内存，已黑化）



2025.10.27 v7.1
【远控面板】
尝试修复有些不同屏幕右键菜单大小不同的问题
修复不开洞穴时，按下CTRL+L或~时概率崩溃的问题
限制此面板只能在玩家处于主游戏页面时才能通过按键控制
·
感谢模组作者【折翼神】提供的技术支持
感谢玩家【B站晓佳乐】还有【Ho啥的】通宵测试！


2025.10.27 v7.0.9
【远控面板】
尝试修复左侧布局位置偏移的问题
尝试修复无法设定指令对象为他人的问题
修复【控制移动】只有左键生效的问题
为洞穴添加了【暴动修改】和【重置远古】的功能
修复【一击必杀】失灵的问题
对部分歧义文本更改


2025.10.27 v7.0
【绘卷·夏】
移除了旧版不再维护的【T键控制台】
现在走上前的是全新的【远控面板】



2025.10.19 v6.502
【绘卷 · 春】
修复键位提示的部分文本错误
部分贴图重绘，为接下来功能做准备

【绘卷 · 风华】
一个简单的【自动抓蝴蝶】功能


2025.10.8 v6.501
【绘卷 · 夏】
【超级宣告】修复宣告巨荒蜈数量错误的问题
【超级宣告】增加时光语料库
【绘卷 · 春】
【隐藏影怪】增加敌意虚影


2025.10.1 v6.402
【绘卷 · 春】
修复部分页面，找不到图标时刷日志的问题
【绘卷 · 秋】
修复几何布局的未知崩溃


2025.9.30 v6.4
【绘卷 冬】
【老麦辅助】新增【不如跳舞】，指定按键可以发表情跳舞

【绘卷 春】
【按键丢物品】默认不再绑定按键（因为官方默认Z是角色技能轮盘，避免冲突）
【自动修复】现已支持模组物品


2025.9.29 v6.31
【绘卷 春】
隐藏影怪：现在能隐藏月灵了，修复远古远古梦魇不能隐藏的问题
自动修复：将自动修复检测时间延长到十秒


2025.9.29 v6.3
【绘卷 夏】
【快捷宣告】修复帧率文本显示错误

【绘卷 春】
感谢金主 花间随柳 的定制，接下来会持续更新几个定制功能
已完成：
【装备脱落】：可自定义绑定物品和耐久设置了
【自动修复】: 可自定义物品耐久值以及修复材料了，对与部分被硬控无法立即修复的情况，可开启强制修复
【隐藏影怪】：
1、现在能立即隐藏了
2、增加了鲨鱼怪和滤镜怪
3、隐藏后会自动屏蔽怪物尖啸声
4、该功能部署在面板，而不是绑定暗影头盔
待开发：
【一键发表情】



2025.9.28 v6.2
感谢金主 花间随柳 的定制，接下来会持续更新几个定制功能
已完成：
【装备脱落】：可自定义绑定物品和耐久设置了
【自动修复】: 可自定义物品耐久值以及修复材料了，对与部分被硬控无法立即修复的情况，可开启强制修复
待开发：
【隐藏影怪】【一键发表情】


2025.9.27 v6.1
感谢金主 花间随柳 的定制，接下来会持续更新几个定制功能
已完成：
【装备脱落】：可自定义绑定物品和耐久设置了
待开发：
【自动修复】【隐藏影怪】【一键发表情】
·
·
接口变动:
i_util:DoTaskInTime不再受游戏暂停的影响了，慎重使用该接口


2025.9.20 v6.004
【我的笔记】修复因科雷移除随机函数导致的崩溃问题

2025.9.8 6.003
【绘卷·夏】
对旺达宣告进行再编辑，感谢小谢提供的文本

【绘卷·春】
点击按钮不再受世界速度的影响了
部分图标资源预加载



2025.8.25 6
【绘卷 春秋冬】
1、对于部分模组的输入框进行适配，不再响应功能
2、提高了获取物品图片和名字的效率
3、允许获取模组角色的图标了



2025.8.22 v5.946
【绘卷·秋】快捷宣告增加了李令仪（模组角色）的专属宣告，作者：小谢
【绘卷·春】不再为多彩服提供支持



2025.8.9 v5.945
【绘卷·春】
【局内面板】修复图标选择页面不能完全展示的问题
【UI设置】修复部分UI鼠标悬浮时不能左右滚动屏幕的问题
【绘卷·秋】
【行为排队论】修复右键可采摘物品的问题



2025.8.7 v5.942
【绘卷·夏】修复部分玩家排队论延迟3帧响应的问题

2025.8.5 v5.94
【绘卷·春夏秋】
【行为排队论】当你shift双击月雹建筑时，将选中范围内所有月雹建筑，而不是仅同类
【行为排队论】允许右键搜刮水獭巢穴
【排队论加强】修复在船上跳跃时发送无效动作的问题
【绘卷·风华】
【兼容测试】修复套娃问题


2025.8.2 v5.93
【绘卷·春】
优化了部分鼠标聚焦的流畅度


2025.8.1 v5.92
【绘卷·春秋】
【绘卷·阿羊】
若干单主要求的美化
若干单主要求的bug修复
为其他篇章增加UI大小的设置接口


2025.8.1 v5.91
【绘卷·春】
【UI相关】部分UI美化

【绘卷·夏秋】
【行为排队论】
1、允许测试服批量晾晒和收取肉干
2、增加适配了挖取月璃的动作



2025.7.30 v5.9
【绘卷·春】
【设置面板】局内弹窗面板设置已经兼容不同大小的游戏屏幕，有定制过相关功能的玩家可查看UI是否受到影响喊我适配
【模组适配】已兼容简易存储



2025.7.27 v5.83
【绘卷·春】
【接口开放】为其他模组增加更多接口



2025.7.10 v5.82
【绘卷·秋】
【行为排队论】支持批量阅读瓶子

【绘卷·春】
【去噪音】增加锯马



2025.6.23 v5.81
【绘卷·冬】
因为科雷增加了快捷键打开技能轮盘，故绘卷移除相关功能
受影响角色：
薇洛、老麦、女工、温蒂、沃尔特
【绘卷·春】
修复某mod显示功能异常


2025.6.13 v5.8
【皮肤套装】修复韦斯套装数据异常的问题
【购买建议】修复打折促销错位的问题


2025.6.3 v5.7
【绘卷·春】
【模组目录】将额外展示mod版本号, 创意工坊mod版本号



2025.5.27 v5.65
【绘卷·飞】定制篇章
【自动打影怪】对影怪按下中键自动走位攻击
【自动打蜘蛛】对蜘蛛按下中键自动走位攻击
【绘卷·春】
一些默认按钮位置更改
修复重置图标有时崩溃的问题
弹窗关闭窗口和弹窗面板允许不关闭了


2025.5.27 v5.64
【绘卷·春】
修复若干bug, 优化若干接口

2025.5.25 v5.63
【面板弹窗】修复指定按钮位置有时不生效的问题


2025.5.19 v5.62
【手动输入】修复【手动输入】在非开发者模式下崩溃的问题


2025.5.17 v5.61
【绘卷·春】
【皮肤预设套装】现在皮弗娄牛也能换皮肤套装了
【绘卷·保安小怂】定制篇章
【范围追踪】现在可以自定义怪物【攻击范围】了
【范围追踪】现在可以自定义【放置范围】了
【范围追踪】现在可以自定义【点击范围】了
【女武神辅助】增加战歌悬浮范围

2025.5.16 v5.6
【绘卷·春】
【制作栏信息】修复部分属性无法游戏内开关显示的问题
【绘卷·冬】
【女武神辅助】增加【战歌效果】的制作栏信息

2025.5.16 v5.5
【绘卷·春】
【皮肤预设套装】在查看角色皮肤页面，可以直接穿套装
【运行库】e_util:GetPrefabName采用缓存机制, 提升流畅度


2025.5.15 v5.4
【绘卷·春】
【礼包购买建议】为商城礼包提供更性价比的建议


2025.5.14 v5.32
【绘卷·琅琊】定制篇章
【方向指示】现在可以自定义增加或删除箭头指示物品，甚至单独更改其颜色了



2025.5.13 v5.31
【绘卷·春】
【空格过滤器】修复骑牛或者施法等特殊状态空格过滤失效的问题


2025.5.12 v5.3
【绘卷·春】
增加【空格筛选器】，你可以游戏内任选空格不响应的物品了


2025.5.11 v5.26
【群鸟绘卷】系列主篇章改名：
藏冰【核心库和主功能】春雨惊春
云霞【有授权的功能】夏满芒夏
江海【无授权的功能】 秋处露秋
霜月【角色辅助】冬雪雪冬
其余篇章命名不变，之后的篇章命名以节气为主


2025.5.11 v5.25
【阿羊篇】定制篇章
【呼吸栏】适配【能力勋章】，接管buff显示
【呼吸栏】适配【富贵险中求】，接管buff显示
【自动翻脚印】适配【岛屿冒险】，自动翻找水泡
【绘卷·春】
【致开发者】新增【图标库】功能，可查看或宣告所有物品的图标代码
【致开发者】t_util:GetChild 已废弃，请尽快用别的接口



2025.5.10 v5.24
【绘卷·春】
【我的笔记】增加图标接口
【千方篇】
【我的笔记】增加【永不妥协】相关数据


2025.5.9 v5.23
【千方篇】定制篇章
【呼吸栏】增加【永不妥协】鼠巢倒计时
【范围追踪】增加【永不妥协】生物的攻击范围
【快捷宣告】增加【永不妥协】角色【沃托姆】快捷宣告
【人物辅助】增加【永不妥协】的角色【沃托姆】辅助
【绘卷·春】
部分ui变动，增加若干开发接口


2025.5.5
【开发者模式】【控制台加强】增加控制台的函数引用
部分ui变动


2025.5.3
【绘卷·冬】
【沃尔特辅助】
1、制作栏显示弹药、弹弓配件属性
2、快捷键支持【打开弹药袋】



2025.5.2
【绘卷·冬】
【沃尔特辅助】
1、远距离可以使用技能轮盘
2、视角不会锁定到沃比
3、视角不会被重置
3、快捷键支持【开关轮盘】【呼唤沃比】【打开沃比】
4、快捷键支持【技能轮盘所有技能】的单独绑定，并决定是否念出行动
【绘卷·春】【方向指示】增加沃比
【风华篇】【制作栏信息】增加属性描述

2025.5.1
【制作栏信息】
1、开放接口，允许其他mod注册显示了
2、增加wiki入口，可以直接跳转到物品的wiki了
【绘卷·冬】【温蒂辅助】制作栏可以预览药剂药效了
【绘卷·夏】【捏捏怪】修复几处文本疏漏
【风华篇5.1】【制作栏信息】增加属性描述

2025.4.28
【风华篇】地形预览增加小丑机
【绘卷·夏】【T键控制台】增加小丑机

2025.4.27
【定制·柑橘篇】
1、增加【幽魂花冠】倒计时
2、增加【暗影姐妹情】倒计时
感谢玩家 老虎 的提议：
【我的笔记】对部分描述进行捉虫
【几何布局】联动【范围追踪】【放置范围】可以游戏内控制部分建筑是否常显了

2025.4.26
v5.02
【快捷宣告】【启用调试】宣告物品或地上的实体后，会将数据保存于t_util.ent
【开发接口】i_util:AddInvItemUseEnd 允许第三个参数func_get，允许获取物品的原始数据
【开发接口】新增AddInvItemWithEnd, AddInvItemWithPre两个接口
v5.01 
感谢玩家 1234 的提议：
【快捷宣告】新增【捏捏怪】语料库

2025.4.12 v5
【致谢玩家】感谢玩家长久以来对绘卷的支持，QQ群暂时解散。
【模组问题】遇到问题请附日志致信邮箱 hanhuxi@qq.com

2025.4.12 v4.87
【行为排队论】修复批量部署建筑失效的问题



2025.4.9 v4.86
【面板弹窗】一处崩溃修复
【智能锅】一处崩溃修复

2025.4.4 v4.84
【范围追踪】移除高鸟的仇恨范围
【风华篇】迁移来自春的【模组兼容测试】
【温蒂辅助】增加【强制攻击】
【开发接口】
允许任何mod通过m_util接口改动弹窗面板
1、BindShowScreenID
2、BindShowScreenTitle

2025.4.3 v4.83
【快捷宣告】
AI喵喵叫增加大量 󰀍
可以在语料库中对某个物品单独定义宣告了
可以在语料库中对语句进行正则替换了
【行为排队论】
禁用了阿比盖尔之花的排队预览（避免崩溃）
【范围追踪】
增加蘑菇灯、龙鳞火炉、夹夹绞盘等多个建筑的放置范围

2025.3.22
【方向指示】
添加小惊吓
【温蒂辅助】
1、增加【阿比盖尔药剂】和【阿比盖尔亲和】倒计时
2、增加【小惊吓辅助】
3、增加【野餐盒子】快捷键
【T键控制台】
部分按键失灵修复，更改部分分类

2025.3.20 v4.81
【T键控制台】
1、恢复为懒人模式，搜索功能不再被隐藏
2、修复移除mod物品时的崩溃
【温蒂辅助】
1、召唤收回阿比盖尔快捷键
2、技能轮盘及其技能快捷键
3、技能CD显示（显示在阿比盖尔之花身上）
4、明后天再写药剂和小惊吓相关的，别急！

2025.3.19 v4.8
【快捷宣告】
1、加入【AI猫娘】宣告喵！
2、加入【慕斯喵喵叫】宣告喵󰀍~
【开发接口】
ShowScreen增加imgstr相关直访变量（低于此版本的绘卷·夏将崩溃）
语料库增加TIP描述，方便作者留言


2025.3.18 v4.74
【快捷宣告】
1、可联动showme/insight/简易血条/epic血条 宣告血量了
2、可联动showme/insight 宣告包裹内容了
【行为排队论】修复一处偶发崩溃
【打包纸记忆】在开启showme/insight后，该功能将自动禁用


2025.3.17 v4.73
【快捷宣告】
1、烹饪锅可以宣告料理了
2、增加WX-78电量宣告，芯片宣告等之后技能树吧
【T键控制台】
修复部分玩家无法传送的问题
【开发接口】
e_util.ClonePrefab:可以稳定返回name了
c_util.HashEqual:进行两个元素的多种形态哈希比对

2025.3.16 v4.72
【快捷宣告】
1、修复宣告蓝图草图广告等不正确的问题
2、为沃比增加低中高三档宣告
3、增加【宣告之锁】和【聊天之锁】，萌新请勿开启
【风华篇】
修复某mod引起的崩溃


2025.3.15
【T键控制台】
1、改进了搜索算法，感谢Luka的帮助
2、现在输入内容就能自动搜索了！
3、将亮茄划分为boss
【快捷宣告】
增加【防止卡键】的功能，如果你改了游戏【强制攻击】【强制堆叠】等按键，禁用此选项就能正常用宣告了

2025.3.14
【T键控制台】修复料理没有调味贴图的bug，感谢Luka的帮助
【几何布局】将默认关闭改为默认显示预览贴图
【我的笔记】修正【寄居蟹任务】
【快捷宣告】
1、修复宣告已死亡实体数量为 0 的问题
2、将猪皮替换为猪头表情了
3、增加【配方整合】，可以批量宣告出所需材料了
4、增加【装备宣告】的设置，将装备栏划分到物品栏中


2025.3.13
【卡键】对T键控制台，自动烹饪，排队论的卡键问题进行优化
【切个手杖】修复了强抢袋不能切手杖的问题
【快捷宣告】
1、区分了金矿和月岛树苗的宣告
2、修复泰拉瑞亚状态宣告反转的问题
3、修复宣告255%新鲜度的问题


2025.3.12
【几何布局】一处偶发崩溃修复


2025.3.11
【快捷宣告】写了个半成品先用着，下周再完善


2025.3.4
【查找物品】逻辑优化，同名物品更容易查找了


2025.3.1
【配方栏】修复启用其他贴图mod时，无法正确拿取物品的问题
代码性能优化、部分崩溃修复


2025.2.29
【几何布局】将【放置预览】改为默认开启
【配方栏】修复3 处已知崩溃


2025.2.28
【自动寻路】将【一键传送】改为默认关闭
【恶魔人辅助】【原地跳跃】改为【指定跳跃】，可跳跃到鼠标指向位置了

2025.2.25
【键位显示】将TLIDE键位图标改为~
【行为排队论】尝试修复mod装备不能犁地铲地皮浇水的问题 --未测试
【更新计划】开发者模式下，会在功能面板展示【更新计划】
【T键控制台】将过去没有分类的物品全部分类
【特别鸣谢】增加鸣谢玩家列表（贡献：整理分类了T键控制台，工作量巨大）
【开发接口】增加t_util:NumThreshold, 用来获取数字属于哪个数列区间
【开发接口】Saver增加了降雨、月相、天数等三个接口
【自动攻击】增加了选项，不再攻击自己的宠物




2025.2.17
【绘卷·春】
【范围追踪】增加潜伏梦魇攻击范围
【呼吸栏】尝试修复一处【自动翻脚印】的偶发崩溃问题
【开发接口】增加一个控制台打印键值的函数FEP_V，对应FEP_K
【范围追踪】增加龙鳞火炉热力范围，但是，当鼠标上有物品时，点击将不再显示范围
【特别鸣谢】增加鸣谢玩家列表（贡献：修复绘卷多个疑难杂症）

【绘卷·秋】JKString修复
【排队论】修复攻击队列装备武器的情况下,必须靠近目标才会攻击的问题
【排队论】修复排队论对自己使用物品时与游戏的冲突(可以对自己排队吃饭读书了)




2025.2.16
【绘卷·春】
【范围追踪】增加水獭攻击范围
【面板与按钮】因为是蛇年的缘故，增加了水獭的样式
【远程指令】该功能设置为仅开发者模式可见，以防萌新误操作

【绘卷·秋】
【行为排队论】现在不会被切屏影响了
【行为排队论】修复伍迪的海狸形态不能砍树的问题
【行为排队论】修复和其他宣告同时启用时触发捡东西的操作


2025.2.11
【日志系统】绘卷终于可以看更新日志了，感谢金主 Sasuke 的定制！
【键位提示】等默认设置修改
【呼吸栏】尝试修复一处【自动翻脚印】的偶发崩溃问题
【节日祝福】祝大家 󰀍情人节快乐!
【友情提示】功能面板-》右键【更新日志】-》打开【弹窗提醒】，这样每次更新就会自动弹出来。



2025.2
已经没有日志辣！感谢订阅！

]=]