return 
[=[

【动作序列】

1、支持动作等待，比方双击抓蝴蝶，可以等待出现就自动抓
2、支持空响应，比如不用准确点击蝴蝶就能双击抓取
3、支持预览，要和实际种植没有巨大出入
4、允许自定义视为同类
5、支持队列攻击，无需按住ctrl+shift，shift双击即可
6、取缔耕地对齐，允许框选种植3*3或者10格
7、支持连续继续给予和对自己使用
8、支持双击施肥和浇水
9、队列攻击进一步加强，允许双击追击海象蝴蝶等，而不是追上又跑开
10、不再是点击为主的逻辑，还是空格优先的逻辑，这样就允许鼠标上有物品也能工作了
11、支持空手点燃树林（限开洞穴）
12、提灯砍树？


【简易几何】

1、精简代码，只保留矩形范围显示
2、按住alt可以自动隐藏鼠标周围的实体，方便摆放（@CyB-T 提供的灵感）
3、显示格子中心点（之前就有这个功能，但是之前写的不是原版的）
4、保留旧版按住ctrl临时开关显示
5、鼠标拿起肥料时总是显示鼠标上的物品（旧版萌新经常问怎么拿起便便不显示）
6、保留旧版点位可以设置色彩的功能
7、保留旧版更改网格大小的功能（或者可以增加一个快捷键，一键显示周围所有点位）
8、保留旧版可选是否显示种植预览的功能
9、保留旧版可选显示鼠标上物品，或者显示数量，或者啥也不显示
10、新增精确放置建筑的功能（就是背着雕像时显示点位嘛）
存疑：
1、保留在耕地可选是否显示网格的功能，但是耕地对齐功能是放在几何还是放在动作序列里呢
2、要不要给几何直接安装圆形种植等功能

]=]